# CannotPasteAlignedSomeLevels Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotPasteAlignedSomeLevels Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't Paste Aligned to some views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPasteAlignedSomeLevels { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPasteAlignedSomeLevels As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPasteAlignedSomeLevels {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace